{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.17.0", "signature": {"inputs": {"input_layer_3": {"name": "input_layer_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "84"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_3_1/conv2d_9_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_9_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_10_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_10_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_11_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_11_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/flatten_3_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_6_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "86528"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_6_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_7_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "84"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_7_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "84"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_3", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_9_1/add", "op": "_FusedConv2D", "input": ["input_layer_3", "StatefulPartitionedCall/sequential_3_1/conv2d_9_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_3_1/conv2d_9_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3_1/max_pooling2d_9_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_3_1/conv2d_9_1/add"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_9_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_3_1/max_pooling2d_9_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_10_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_3_1/conv2d_9_1/Relu", "StatefulPartitionedCall/sequential_3_1/conv2d_10_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_3_1/conv2d_10_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3_1/max_pooling2d_10_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_3_1/conv2d_10_1/add"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_10_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_3_1/max_pooling2d_10_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_11_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_3_1/conv2d_10_1/Relu", "StatefulPartitionedCall/sequential_3_1/conv2d_11_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_3_1/conv2d_11_1/Reshape"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3_1/max_pooling2d_11_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_3_1/conv2d_11_1/add"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_11_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_3_1/max_pooling2d_11_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/flatten_3_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_3_1/conv2d_11_1/Relu", "StatefulPartitionedCall/sequential_3_1/flatten_3_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_6_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3_1/flatten_3_1/Reshape", "StatefulPartitionedCall/sequential_3_1/dense_6_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_3_1/dense_6_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_7_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3_1/dense_6_1/Relu", "StatefulPartitionedCall/sequential_3_1/dense_7_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_3_1/dense_7_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_7_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_3_1/dense_7_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3_1/dense_7_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1645}}, "weightsManifest": [{"paths": ["group1-shard1of43.bin", "group1-shard2of43.bin", "group1-shard3of43.bin", "group1-shard4of43.bin", "group1-shard5of43.bin", "group1-shard6of43.bin", "group1-shard7of43.bin", "group1-shard8of43.bin", "group1-shard9of43.bin", "group1-shard10of43.bin", "group1-shard11of43.bin", "group1-shard12of43.bin", "group1-shard13of43.bin", "group1-shard14of43.bin", "group1-shard15of43.bin", "group1-shard16of43.bin", "group1-shard17of43.bin", "group1-shard18of43.bin", "group1-shard19of43.bin", "group1-shard20of43.bin", "group1-shard21of43.bin", "group1-shard22of43.bin", "group1-shard23of43.bin", "group1-shard24of43.bin", "group1-shard25of43.bin", "group1-shard26of43.bin", "group1-shard27of43.bin", "group1-shard28of43.bin", "group1-shard29of43.bin", "group1-shard30of43.bin", "group1-shard31of43.bin", "group1-shard32of43.bin", "group1-shard33of43.bin", "group1-shard34of43.bin", "group1-shard35of43.bin", "group1-shard36of43.bin", "group1-shard37of43.bin", "group1-shard38of43.bin", "group1-shard39of43.bin", "group1-shard40of43.bin", "group1-shard41of43.bin", "group1-shard42of43.bin", "group1-shard43of43.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_3_1/conv2d_9_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_9_1/Reshape", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_10_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_10_1/Reshape", "shape": [1, 1, 1, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_11_1/convolution/ReadVariableOp", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3_1/conv2d_11_1/Reshape", "shape": [1, 1, 1, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3_1/flatten_3_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_6_1/Cast/ReadVariableOp", "shape": [86528, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_6_1/Add/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_7_1/Cast/ReadVariableOp", "shape": [512, 84], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3_1/dense_7_1/Add/ReadVariableOp", "shape": [84], "dtype": "float32"}]}]}